app/Http/Controllers/Auth/LoginController.php

select * from "users" where "email" = 'takah04237@gmail.com' limit 1
---
    public function handleProviderCallback(Request $request, string $provider)
    {
        $providerUser = Socialite::driver($provider)->stateless()->user();

        $user = User::where('email', $providerUser->getEmail())->first();