app/Http/Controllers/ArticleController.php

select "tags".*, "article_tag"."article_id" as "pivot_article_id", "article_tag"."tag_id" as "pivot_tag_id", "article_tag"."created_at" as "pivot_created_at", "article_tag"."updated_at" as "pivot_updated_at" from "tags" inner join "article_tag" on "tags"."id" = "article_tag"."tag_id" where "article_tag"."article_id" in (1, 2)
select "users".*, "likes"."article_id" as "pivot_article_id", "likes"."user_id" as "pivot_user_id", "likes"."created_at" as "pivot_created_at", "likes"."updated_at" as "pivot_updated_at" from "users" inner join "likes" on "users"."id" = "likes"."user_id" where "likes"."article_id" in (1, 2)
select * from "articles"
---
    public function index(Request $request)
    {

        $articles = Article::all()->sortByDesc('created_at')
            ->load(['user', 'likes', 'tags']);

select * from "tags"
---
    public function create()
    {
        $allTagNames = Tag::all()->map(function ($tag){
            return['text'=> $tag->name];
        });

insert into "articles" ("title", "body", "user_id", "updated_at", "created_at") values ('docker-compose時のエラー', 'efewf', 1, '2021-05-08 18:56:47', '2021-05-08 18:56:47') returning "id"
---
    public function store(ArticleRequest $request, Article $article) //-- ArticleクラスのDI(Dependency Injection)を行っている
    {
        // $article = new Article(); //-- storeアクションメソッド内でArticleクラスのインスタンスを生成している
        $article->fill($request->all());  //article.php fillableで不正なPOSTリクエストを防ぐことができる
        $article->user_id = $request->user()->id;
        $article->save();

delete from "likes" where "likes"."article_id" = 1 and "likes"."user_id" in (2)
insert into "likes" ("article_id", "created_at", "updated_at", "user_id") values (1, '2021-05-09 13:58:38', '2021-05-09 13:58:38', 2)
---
    public function like(Request $request, Article $article)
    {
        $article->likes()->detach($request->user()->id);
        $article->likes()->attach($request->user()->id);