app/Http/Controllers/UserController.php

select "tags".*, "article_tag"."article_id" as "pivot_article_id", "article_tag"."tag_id" as "pivot_tag_id", "article_tag"."created_at" as "pivot_created_at", "article_tag"."updated_at" as "pivot_updated_at" from "tags" inner join "article_tag" on "tags"."id" = "article_tag"."tag_id" where "article_tag"."article_id" in (1, 2)
select "users".*, "likes"."article_id" as "pivot_article_id", "likes"."user_id" as "pivot_user_id", "likes"."created_at" as "pivot_created_at", "likes"."updated_at" as "pivot_updated_at" from "users" inner join "likes" on "users"."id" = "likes"."user_id" where "likes"."article_id" in (1, 2)
select * from "articles" where "articles"."user_id" in (1)
---
    public function show(string $name){
        $user = User::where('name', $name)->first()
        ->load(['articles.user', 'articles.likes', 'articles.tags']);

select * from "users" where "name" = 'ponsata' limit 1
---
    public function likes(string $name)
    {
        $user = User::where('name', $name)->first()
            ->load(['likes.user', 'likes.likes', 'likes.tags']);

select "users".*, "follows"."follower_id" as "pivot_follower_id", "follows"."followee_id" as "pivot_followee_id", "follows"."created_at" as "pivot_created_at", "follows"."updated_at" as "pivot_updated_at" from "users" inner join "follows" on "users"."id" = "follows"."followee_id" where "follows"."follower_id" in (2)
---
    public function followings(string $name)
    {
        $user = User::where('name', $name)->first()
            ->load('followings.followers');

select * from "users" where "name" = 'satake' limit 1
insert into "follows" ("created_at", "followee_id", "follower_id", "updated_at") values ('2021-05-09 13:58:53', 1, 2, '2021-05-09 13:58:53')
---
    public function follow(Request $request, string $name)
    {
        $user = User::where('name', $name)->first();

        if ($user->id === $request->user()->id)//フォローされるユーザとリクエストするユーザーが同じ場合エラーを返す条件
        {
            return abort('404', 'Cannot follow yourself.');
        }

        $request->user()->followings()->detach($user);
        $request->user()->followings()->attach($user);